Практика1/src/Documents/ПополнениеСемейногоБюджета/ПополнениеСемейногоБюджета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПополнениеСемейногоБюджета</name>
  <registerRecords>AccumulationRegister.ЕжедневныеРасходы</registerRecords>
  <attributes>
    <name>УчастникСемьи</name>
    <type>
      <types>CatalogRef.УчастникиСемьи</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПополнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

Практика1/src/AccumulationRegisters/ЕжедневныеРасходы/ЕжедневныеРасходы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЕжедневныеРасходы</name>
  <resources>
    <name>СуммаРасходов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>КатегорияРасходов</name>
    <type>
      <types>CatalogRef.КатегорииРасходов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УчастникСемьи</name>
    <type>
      <types>CatalogRef.УчастникиСемьи</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Практика1/src/Documents/ПополнениеСемейногоБюджета/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ЕжедневныеРасходы Приход
	Движения.ЕжедневныеРасходы.Записывать = Истина;
	Движение = Движения.ЕжедневныеРасходы.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.КатегорияРасходов = Справочники.КатегорииРасходов.ПополнениеБюджета;
	Движение.УчастникСемьи = УчастникСемьи;
	Движение.СуммаРасходов = СуммаПополнения;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
